{
  "id": "britecore",
  "company": "TEAM International / Britecore",
  "position": "Senior Full-Stack Developer | AI-Augmented Development | Cloud-Native Insurance Platform",
  "location": "United States · Remote",
  "startDate": "2020-04",
  "endDate": null,
  "isCurrent": true,
  "description": "Leveraging Agentic AI for High-Performance Software Delivery. Currently working on a cloud-native platform for P&C insurers, integrating Agentic AI into the development workflow. I plan tasks with AI agents and have customized rules in Cursor IDE to align AI outputs with project standards. Leading two major initiatives: migrating the system to Python 3 and introducing a significant new feature to expand platform capabilities.",
  "technologies": [
    "Python",
    "Vue.js",
    "Docker",
    "Kubernetes",
    "AWS",
    "GitHub",
    "CI/CD",
    "Agentic AI",
    "Django",
    "Salesforce",
    "Google Analytics",
    "Marketing Cloud",
    "Bright Pattern",
    "SiteSpect",
    "Google Tag Manager"
  ],
  "achievements": [
    "Developing scalable APIs and backend features using Python, while also building intuitive UIs with Vue.js",
    "Ensuring seamless integration of frontend and backend components, and maintaining high code quality through comprehensive unit and integration testing",
    "Improving and managing Docker environments for efficient local development",
    "Contributing to CI/CD processes and automating tasks for increased productivity",
    "Active in agile ceremonies, participating in planning, conducting code reviews, and providing mentorship",
    "Collaborating with cross-functional teams on feature development and integration",
    "Troubleshooting and debugging complex issues",
    "Ensuring development consistency through scripting and automation",
    "Enhancing developer efficiency through AI-assisted tooling and process automation",
    "Expanding AI engineering capabilities via IBM Generative AI Engineering and AI Engineering Specialization programs on Coursera"
  ],
  "companyLogo": "/images/britecore_logo.svg",
  "companyUrl": "https://britecore.com",
  "priority": 8
}
